In [30]:
import pandas as pd     # data processing
import numpy as np     # linear alzebra
from sklearn import tree
from sklearn.tree import DecisionTreeClassifier
from sklearn.preprocessing import LabelEncoder

In [3]:
train=pd.read_csv("train.csv")

In [4]:
test=pd.read_csv("test.csv")

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
train_new = train[["Survived","Age", "Sex", "Fare"]]

In [10]:
test_new = test[["Age","Sex","Fare"]]

In [11]:
train_new.head()

   Survived   Age     Sex     Fare
0         0  22.0    male   7.2500
1         1  38.0  female  71.2833
2         1  26.0  female   7.9250
3         1  35.0  female  53.1000
4         0  35.0    male   8.0500

In [12]:

test_new.head()

    Age     Sex     Fare
0  34.5    male   7.8292
1  47.0  female   7.0000
2  62.0    male   9.6875
3  27.0    male   8.6625
4  22.0  female  12.2875

In [13]:
train_new.isnull().sum()

Survived    0
Age         0
Sex         0
Fare        0
dtype: int64

In [14]:
train_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  889 non-null    int64
 1   Age       889 non-null    float64
 2   Sex       889 non-null    object
 3   Fare      889 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 27.9+ KB

In [15]:
train_new.describe()

         Survived         Age        Fare
count  889.000000  889.000000  889.000000
mean     0.382452   32.699854   32.096681
std      0.486260   14.346821   49.697504
min      0.000000    0.420000    0.000000
25%      0.000000   22.000000    7.895800
50%      0.000000   32.000000   14.454200
75%      1.000000   45.000000   31.000000
max      1.000000   80.000000  512.329200

In [16]:
label_enc = LabelEncoder()

In [17]:
train_final = train_new.copy()
train_final["Sex"] = label_enc.fit_transform(train_new["Sex"])

In [18]:
test_final = test_new.copy()
test_final["Sex"] = label_enc.fit_transform(test_new["Sex"])

In [19]:
train_final.head()

   Survived   Age  Sex     Fare
0         0  22.0    1   7.2500
1         1  38.0    0  71.2833
2         1  26.0    0   7.9250
3         1  35.0    0  53.1000
4         0  35.0    1   8.0500

In [20]:
test_final.head()

    Age  Sex     Fare
0  34.5    1   7.8292
1  47.0    0   7.0000
2  62.0    1   9.6875
3  27.0    1   8.6625
4  22.0    0  12.2875

In [21]:
x_train = train_final[["Age", "Sex", "Fare"]]

In [22]:
y_train = train_final["Survived"]

In [27]:
model = DecisionTreeClassifier()

In [28]:
model.fit(x_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [33]:
round(model.score(x_train, y_train) * 100, 2)

97.64

In [37]:
pred=model.predict(test_final)
pred

array([0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1,
       1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1,
       0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1,
       1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1,
       1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1,
       1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0,
       1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0],
      dtype=int64)

In [38]:
pd.DataFrame({"Age":test_final["Age"], "Sex":test_final["Sex"],"Fare":test_final["Fare"],"Survived":pred})

      Age  Sex      Fare  Survived
0    34.5    1    7.8292         0
1    47.0    0    7.0000         1
2    62.0    1    9.6875         0
3    27.0    1    8.6625         1
4    22.0    0   12.2875         0
..    ...  ...       ...       ...
412  45.0    1    8.0500         0
413  39.0    0  108.9000         1
414  38.5    1    7.2500         0
415  45.0    1    8.0500         0
416  45.0    1   22.3583         0

[417 rows x 4 columns]